{
  "extension.displayName": "Electivus Visualizador de Logs Apex",
  "extension.description": "Logs Apex rápidos e pesquisáveis no VS Code — navegue, filtre, faça tail e depure com Apex Replay.",
  "salesforce.panel.title": "Electivus Apex Logs",
  "salesforce.tail.panel.title": "Electivus Apex Logs Tail",
  "salesforce.logs.view.name": "Electivus Apex Logs",
  "salesforce.tail.view.name": "Electivus Apex Logs Tail",
  "command.refresh.title": "Atualizar Logs",
  "command.selectOrg.title": "Selecionar Org",
  "command.tail.title": "Tail de Logs",
  "command.showDiagram.title": "Mostrar Diagrama do Log",
  "configuration.title": "Electivus Apex Logs",
  "configuration.electivus.apexLogs.pageSize.description": "Quantidade de logs por página (máximo efetivo: 200). Valores maiores trazem mais por requisição, mas podem deixar a UI mais lenta ou aumentar a carga nas APIs.",
  "configuration.electivus.apexLogs.headConcurrency.description": "Número máximo de requisições concorrentes para buscar cabeçalhos. Valores muito altos podem sobrecarregar as APIs do Salesforce ou atingir limites de rate.",
  "configuration.electivus.apexLogs.saveDirName.description": "Pasta dentro do workspace onde os logs Apex são salvos. Se vazio, a extensão tenta detectar uma pasta existente 'apexlog' ou usa 'apexlogs'.",
  "configuration.electivus.apexLogs.tailBufferSize.description": "Quantidade de linhas mantidas no buffer do Tail. Buffers maiores consomem mais memória e CPU.",
  "configuration.electivus.apexLogs.cliCache.enabled.description": "Ativa cache persistente para chamadas do Salesforce CLI (lista de orgs, etc.).",
  "configuration.electivus.apexLogs.cliCache.orgListTtlSeconds.description": "TTL em segundos para o cache do resultado de 'sf org list'. Defina 0 para desativar. TTLs grandes mantêm resultados por mais tempo, porém podem ficar desatualizados.",
  "configuration.electivus.apexLogs.cliCache.authTtlSeconds.description": "TTL curto em memória (segundos) para cachear credenciais obtidas via CLI. Tokens NÃO são persistidos. Valores maiores reduzem chamadas ao CLI, mas aumentam a janela de reutilização.",
  "configuration.electivus.apexLogs.cliCache.authPersistentTtlSeconds.description": "TTL persistente (segundos) para o cache de 'sf org display'. Armazena o token no VS Code para evitar chamadas repetidas entre recarregamentos. Valores maiores reduzem chamadas ao CLI, mas mantêm o auth em cache por mais tempo; defina 0 para desativar.",
  "configuration.electivus.apexLogs.cliCache.debugLevelsTtlSeconds.description": "TTL em segundos para o cache de consultas DebugLevel. Defina 0 para desativar. TTLs grandes reduzem chamadas à API, mas podem servir dados desatualizados.",
  "tailSaveFailed": "Tail: falha ao salvar log no workspace (melhor esforço)."
}
