{
  "extension.displayName": "Electivus Apex Log Viewer",
  "extension.description": "Fast, searchable Salesforce Apex logs in VS Code — browse, filter, tail, and debug with Apex Replay.",
  "salesforce.panel.title": "Electivus Apex Logs",
  "salesforce.tail.panel.title": "Electivus Apex Logs Tail",
  "salesforce.logs.view.name": "Electivus Apex Logs",
  "salesforce.tail.view.name": "Electivus Apex Logs Tail",
  "command.refresh.title": "Refresh Logs",
  "command.selectOrg.title": "Select Org",
  "command.tail.title": "Tail Logs",
  "command.openLogInViewer.title": "Open in Apex Log Viewer",
  "configuration.title": "Electivus Apex Logs",
  "configuration.electivus.apexLogs.pageSize.description": "Number of logs to fetch per page (effective maximum: 200). Higher values fetch more per request but may slow the UI or increase API load.",
  "configuration.electivus.apexLogs.headConcurrency.description": "Maximum concurrent requests to fetch log headers. Very high values may overload Salesforce APIs or hit rate limits.",
  "configuration.electivus.apexLogs.saveDirName.description": "Folder under the workspace where Apex logs are saved. If empty, the extension will auto-detect an existing 'apexlog' folder or use 'apexlogs'.",
  "configuration.electivus.apexLogs.cliPath.description": "Path to the apex-log-viewer CLI binary. Leave empty to use APEX_LOG_VIEWER_CLI or your PATH.",
  "configuration.electivus.apexLogs.tailBufferSize.description": "Lines kept in the Tail view's rolling buffer. Larger buffers use more memory and CPU.",
  "configuration.electivus.apexLogs.cliCache.enabled.description": "Enable persistent caching for Salesforce CLI calls (org list, etc.).",
  "configuration.electivus.apexLogs.cliCache.orgListTtlSeconds.description": "TTL in seconds for cached results of 'sf org list'. Set 0 to disable. Large TTLs keep results longer but may be stale.",
  "configuration.electivus.apexLogs.cliCache.authTtlSeconds.description": "Short-lived in-memory TTL (seconds) for cached auth tokens acquired via CLI. Tokens are NOT persisted. Larger values reduce CLI calls but increase the reuse window.",
  "configuration.electivus.apexLogs.cliCache.authPersistentTtlSeconds.description": "Persistent TTL in seconds for cached results of 'sf org display'. Stores the token in VS Code storage to avoid repeated CLI calls across reloads. Larger values reduce CLI calls but keep cached auth longer; set 0 to disable.",
  "configuration.electivus.apexLogs.cliCache.debugLevelsTtlSeconds.description": "TTL in seconds for cached DebugLevel queries. Set 0 to disable. Large TTLs reduce API calls but may serve stale data.",
  "configuration.electivus.apexLogs.enableFullLogSearch.description": "Download full Apex log bodies in the list view so the search box can match log content. This consumes more bandwidth and memory; disable if you only need header searches.",
  "tailSaveFailed": "Tail: failed to save log to workspace (best-effort).",
  "openLogInViewer.noDocument": "Electivus Apex Logs: No Apex log is active.",
  "openLogInViewer.unsupportedScheme": "Electivus Apex Logs: Unable to open Apex logs from this location.",
  "openLogInViewer.notApex": "Electivus Apex Logs: The active document is not recognized as a Salesforce Apex log.",
  "openLogInViewer.failed": "Failed to open Apex log: {0}",
  "openLogInViewer.codeLensTitle": "Open in Apex Log Viewer"
}
